Show / Hide Table of Contents
Class ResultOfInteractionDiagramPlane
Result of Interaction diagram in plane
Inheritance
System.Object
SectionResultBase
ResultOfInteractionDiagramPlane
Inherited Members
 SectionResultBase.Loading
 System.Object.ToString()
 System.Object.Equals(System.Object)
 System.Object.Equals(System.Object, System.Object)
 System.Object.ReferenceEquals(System.Object, System.Object)
 System.Object.GetHashCode()
 System.Object.GetType()
 System.Object.MemberwiseClone()
Namespace: IdeaRS.OpenModel.Result
Assembly: IdeaRS.OpenModel.dll
Syntax
[Obfuscation(Feature = "renaming")]
public class ResultOfInteractionDiagramPlane : SectionResultBase
Constructors
Improve this Doc   View Source
ResultOfInteractionDiagramPlane()
Constructor
Declaration
public ResultOfInteractionDiagramPlane()
Properties
Improve this Doc   View Source
LoadChart
Polygon of Load
Declaration
public PolygonPointID LoadChart { get; set; }
Property Value
 Type |  Description
 PolygonPointID
Improve this Doc   View Source
Plane
Polygon of interaction diagram plane
Declaration
public PolygonPointID Plane { get; set; }
Property Value
 Type |  Description
 PolygonPointID
 Improve this Doc
 View Source